In [43]:
people = {
    "first" : ["Jane", "John", "Tommy"],
    "last" : ["doe", "doe", "White"],
    "email" : ["janedoe@gmail.com", "johndoe@gmail.com", "tommy@yahoo.com"]
}

In [44]:
people['first']

['Jane', 'John', 'Tommy']

In [45]:
import pandas as pd

In [46]:
df = pd.DataFrame(users)

In [47]:
df

   first   last              email
0   Jane    doe  janedoe@gmail.com
1   John    doe  johndoe@gmail.com
2  Tommy  White    tommy@yahoo.com

In [48]:
df[['first', 'email']]

   first              email
0   Jane  janedoe@gmail.com
1   John  johndoe@gmail.com
2  Tommy    tommy@yahoo.com

In [49]:
type(df['email'])

pandas.core.series.Series

In [50]:
df.columns

Index(['first', 'last', 'email'], dtype='object')

In [51]:
df.iloc[[0, 1]]

  first last              email
0  Jane  doe  janedoe@gmail.com
1  John  doe  johndoe@gmail.com

In [52]:
df

   first   last              email
0   Jane    doe  janedoe@gmail.com
1   John    doe  johndoe@gmail.com
2  Tommy  White    tommy@yahoo.com

In [53]:
df.loc[[0, 1], ['first', 'email']]

  first              email
0  Jane  janedoe@gmail.com
1  John  johndoe@gmail.com

In [54]:
df

   first   last              email
0   Jane    doe  janedoe@gmail.com
1   John    doe  johndoe@gmail.com
2  Tommy  White    tommy@yahoo.com

In [55]:
df.set_index('index', inplace=True)

KeyError: "None of ['index'] are in the columns"

In [56]:
df['last'] == "doe"

0     True
1     True
2    False
Name: last, dtype: bool

In [57]:
df

   first   last              email
0   Jane    doe  janedoe@gmail.com
1   John    doe  johndoe@gmail.com
2  Tommy  White    tommy@yahoo.com

In [69]:
filt = (df['last'] == 'doe') & (df['first'] == 'Jane') # filter | Print email's that are equal to ... 
my_filter = (df['last'] == 'White') & (df['first'] == 'Tommy')

In [76]:
df[filt] # print the data frame of "filt"
df.loc[my_filter, ['last', 'first']]

    last  first
2  White  Tommy

In [65]:
df.loc[filt, ['last', 'email']] # print the data frame of "filt" by location .

  last              email
0  doe  janedoe@gmail.com

In [77]:
tommy = df.loc[my_filter, ['first', 'last']]

In [79]:
tommy

   first   last
2  Tommy  White

In [93]:
filt = (df['last'] != 'doe') & (df['first'] != 'Jane')

In [95]:
df[~filt]

  first last              email
0  Jane  doe  janedoe@gmail.com
1  John  doe  johndoe@gmail.com